[
  {
    "alex": "So, have you finally texted her?",
    "cz_reply": "Jo, napsal jsem jí dnes ráno.",
    "accepted_answers": [
      "Yeah, I've texted her this morning.",
      "I have sent her a message this morning.",
      "Yes, I texted her this morning.",
      "I've messaged her today.",
      "Yeah, I sent her a text this morning.",
      "I have texted her earlier today."
    ]
  },
  {
    "alex": "Nice! What did she say?",
    "cz_reply": "Odpověděla mi velmi slušně a zdvořile.",
    "accepted_answers": [
      "She has replied very politely.",
      "She replied really politely.",
      "She's responded very formally.",
      "She has answered very nicely.",
      "She replied in a very polite way.",
      "She's been very polite in her response."
    ]
  },
  {
    "alex": "Sounds formal. Are you sure you texted the right person?",
    "cz_reply": "Podíval jsem se na jméno a bylo tam Jana Nováková.",
    "accepted_answers": [
      "I've checked the name and it was Jana Nováková.",
      "I checked the name – it was Jana Nováková.",
      "I have looked at the name and it said Jana Nováková.",
      "I've looked at the contact and it's Jana Nováková.",
      "I checked the contact name - Jana Nováková.",
      "The name shows Jana Nováková."
    ]
  },
  {
    "alex": "Wait… isn't that our teacher's name?",
    "cz_reply": "Eh... jo, to je asi ona.",
    "accepted_answers": [
      "Uh... yeah, I guess it's her.",
      "Yeah... that's probably her.",
      "Eh... yes, I think it's her.",
      "Um... yeah, that's likely her.",
      "Oh... yes, I believe it's her.",
      "Uh... I think that's her."
    ]
  },
  {
    "alex": "Dude! Have you been flirting with the teacher?",
    "cz_reply": "Napsal jsem jí, že má krásné oči.",
    "accepted_answers": [
      "I've told her she has beautiful eyes.",
      "I told her she's got beautiful eyes.",
      "I have written that she has beautiful eyes.",
      "I've messaged her about her beautiful eyes.",
      "I said she has pretty eyes.",
      "I've complimented her eyes."
    ]
  },
  {
    "alex": "Brooo! What did she reply?",
    "cz_reply": "Napsala, že je ráda, že si toho někdo všiml.",
    "accepted_answers": [
      "She said she's glad someone noticed.",
      "She has written that she's happy someone noticed.",
      "She replied that she's pleased someone noticed.",
      "She's said she's glad someone paid attention.",
      "She wrote that she's happy about the compliment.",
      "She has responded that she appreciates someone noticing."
    ]
  },
  {
    "alex": "Wait what?! She didn't get angry?",
    "cz_reply": "Ne, dokonce mi napsala, že si můžeme popovídat.",
    "accepted_answers": [
      "No, she has even written that we can chat.",
      "No, she's even said we can talk.",
      "She has even suggested we could have a conversation.",
      "No, she's even mentioned we could chat.",
      "She has even written that we should talk sometime.",
      "No, she's even invited me to chat."
    ]
  },
  {
    "alex": "This is getting weird. Have you told your parents?",
    "cz_reply": "Ne, ještě ne, ale možná bych měl.",
    "accepted_answers": [
      "No, not yet, but maybe I should.",
      "I haven't told them yet, but perhaps I should.",
      "No, but I think I should tell them.",
      "Not yet, but I probably should.",
      "I haven't, but maybe I ought to.",
      "No, but I'm thinking I should."
    ]
  },
  {
    "alex": "Yeah, this has gotten out of hand. Have you considered talking to the principal?",
    "cz_reply": "Myslím, že bych to měl udělat.",
    "accepted_answers": [
      "I think I should do that.",
      "I believe I should.",
      "I think that's what I should do.",
      "Yes, I think I should.",
      "I believe that's the right thing to do.",
      "I think I need to do that."
    ]
  },
  {
    "alex": "Good. Have you learned anything from this experience?",
    "cz_reply": "Ano, příště si lépe zkontroluju, komu píšu.",
    "accepted_answers": [
      "Yes, I'll check who I'm texting next time.",
      "I have learned to check who I'm messaging.",
      "Yes, I'll be more careful about who I text.",
      "I've learned to double-check contact names.",
      "I'll make sure to verify who I'm messaging.",
      "Yes, I need to be more careful with contacts."
    ]
  }
]
