[
  {
    "alex": "Bro, have you seen the new Skibidi Toilet episode?",
    "cz_reply": "Jo, ten s Chuckem Norrisem a panem Wimmerem byl šílený.",
    "accepted_answers": [
      "Yeah, the one with Chuck Norris and Mr. Wimmer was insane.",
      "I've seen it, the Chuck Norris and Mr. Wimmer cameo was wild.",
      "Yes, that Chuck Norris and Mr. Wimmer episode was crazy.",
      "I watched it, the crossover was absolutely wild.",
      "Yeah, that collaboration was mental.",
      "I've watched it, totally insane episode."
    ]
  },
  {
    "alex": "I've been watching it on loop. Peak cinematography.",
    "cz_reply": "Vrchol kinematografie, no cap.",
    "accepted_answers": [
      "Peak cinematography, no cap.",
      "It's the pinnacle of filmmaking, no cap.",
      "Absolute cinema, no cap.",
      "Pure art, no cap.",
      "Top tier content, no cap.",
      "It's cinema at its finest, no cap."
    ]
  },
  {
    "alex": "Did you try the new Sigma Boy dance challenge?",
    "cz_reply": "Jo, ale skončil jsem s mňaukajícími Alexy v pozadí.",
    "accepted_answers": [
      "Yeah, but I ended up with meowing Alexes in the background.",
      "I tried, but those meowing Alexes photobombed me.",
      "Yes, but the meowing Alexes ruined it.",
      "I attempted it, but got meowing Alexes instead.",
      "Yeah, but meowing Alexes appeared in my video.",
      "I did, but those Alexes were meowing behind me."
    ]
  },
  {
    "alex": "I've posted my attempt, got 3 likes and a comment in Chinese.",
    "cz_reply": "To je víc, než jsem čekal. Skibidi bop yes yes.",
    "accepted_answers": [
      "That's more than I expected. Skibidi bop yes yes.",
      "More engagement than I thought. Skibidi bop yes yes.",
      "Better than I anticipated. Skibidi bop yes yes.",
      "That's actually good. Skibidi bop yes yes.",
      "More than I got. Skibidi bop yes yes.",
      "That's impressive. Skibidi bop yes yes."
    ]
  },
  {
    "alex": "Have you seen the 'Low Taper Fade' meme with Ninja?",
    "cz_reply": "Jo, ale Ninja s tím účesem vypadá sus.",
    "accepted_answers": [
      "Yeah, but Ninja looks sus with that haircut.",
      "I've seen it, Ninja's haircut is kinda sus.",
      "Yes, but that haircut makes Ninja look suspicious.",
      "I watched it, Ninja looks weird with that cut.",
      "Yeah, Ninja's new look is sus.",
      "I've seen it, the haircut is questionable."
    ]
  },
  {
    "alex": "I've set it as my phone wallpaper. It's giving brain rot.",
    "cz_reply": "To je doslova můj vibe teď.",
    "accepted_answers": [
      "That's literally my vibe right now.",
      "Same, that's the mood I'm in.",
      "That's exactly how I feel.",
      "Literally me right now.",
      "That's my current energy.",
      "Same vibe, honestly."
    ]
  },
  {
    "alex": "Did you hear the 'Hawk Tuah' remix at the school assembly?",
    "cz_reply": "Jo, ředitel vypadal, že neví, co se děje.",
    "accepted_answers": [
      "Yeah, the principal looked like he had no idea what was happening.",
      "I saw it, the principal was so confused.",
      "Yes, the principal seemed completely lost.",
      "The principal's face was priceless.",
      "Yeah, he looked totally bewildered.",
      "I watched it, the principal was so confused."
    ]
  },
  {
    "alex": "I've never seen someone so lost. Pure Ohio energy.",
    "cz_reply": "Fakt Ohio moment.",
    "accepted_answers": [
      "Definitely an Ohio moment.",
      "Pure Ohio vibes.",
      "That was so Ohio.",
      "Classic Ohio energy.",
      "Total Ohio situation.",
      "Most Ohio thing ever."
    ]
  },
  {
    "alex": "Have you tried the new 'Ice Spice Sigma Grindset' workout?",
    "cz_reply": "Jo, ale moje máma si myslí, že jsem posedlý.",
    "accepted_answers": [
      "Yeah, but my mom thinks I'm obsessed.",
      "I tried it, but my mother thinks I'm addicted.",
      "Yes, but my mom says I'm going crazy.",
      "I have, but my mom thinks I've lost it.",
      "Yeah, my mom thinks I'm becoming weird.",
      "I did, but my mom is concerned about me."
    ]
  },
  {
    "alex": "Moms just don't understand the grind. Have you reached level Gyatt yet?",
    "cz_reply": "Ještě ne, ale pracuju na tom každý den.",
    "accepted_answers": [
      "Not yet, but I'm working on it every day.",
      "I haven't reached it yet, but I'm grinding daily.",
      "Still working towards it every day.",
      "Not there yet, but I'm putting in the work.",
      "Still grinding, not quite there.",
      "I'm working on it every single day."
    ]
  }
]
