[
  {
    "alex": "Have you seen the latest viral TikTok trend?",
    "cz_reply": "Ano, viděl jsem ten nejnovější virální TikTok trend.",
    "accepted_answers": [
      "Yes, I have seen the latest viral TikTok trend.",
      "I have watched the newest viral TikTok trend."
    ]
  },
  {
    "alex": "People have been obsessed with short videos recently.",
    "cz_reply": "Lidé byli posedlí krátkými videi v poslední době.",
    "accepted_answers": [
      "People have been obsessed with short videos recently.",
      "Everyone has loved short videos lately."
    ]
  },
  {
    "alex": "Have you posted any reels on Instagram this week?",
    "cz_reply": "Ne, tento týden jsem nepřidal žádné reels.",
    "accepted_answers": [
      "No, I haven't posted any reels this week.",
      "Yes, I have posted some reels on Instagram this week."
    ]
  },
  {
    "alex": "I have noticed that reels get more views than normal posts.",
    "cz_reply": "Všiml jsem si, že reels dostávají více zhlédnutí než běžné příspěvky.",
    "accepted_answers": [
      "I have noticed that reels get more views than normal posts.",
      "Reels have gotten more views than regular posts."
    ]
  },
  {
    "alex": "Have you ever gone viral on any platform?",
    "cz_reply": "Ne, nikdy jsem nebyl virální na žádné platformě.",
    "accepted_answers": [
      "No, I haven't gone viral on any platform.",
      "Yes, I have gone viral once."
    ]
  },
  {
    "alex": "Do you think social media have changed how we communicate?",
    "cz_reply": "Ano, sociální sítě změnily způsob, jak komunikujeme.",
    "accepted_answers": [
      "Yes, social media have changed how we communicate.",
      "No, social media haven't changed communication that much."
    ]
  },
  {
    "alex": "I have used memes to express my mood more than once.",
    "cz_reply": "Použil jsem memy k vyjádření nálady více než jednou.",
    "accepted_answers": [
      "I have used memes to express my mood more than once.",
      "Yes, I have used memes to show how I feel."
    ]
  }
]

