[
  {
    "alex": "Have you tried virtual reality yet?",
    "cz_reply": "Ano, zkusil jsem VR brýle u kamaráda.",
    "accepted_answers": [
      "Yes, I've tried VR headset at my friend's.",
      "I've tried VR goggles at a friend's place.",
      "Yes, I tested VR headset at my friend's house.",
      "I've experienced VR at my friend's.",
      "Yes, I've used VR glasses at a friend's.",
      "I tried VR equipment at my friend's place."
    ]
  },
  {
    "alex": "What did you think about it?",
    "cz_reply": "Bylo to úžasné! Cítil jsem se jako v jiném světě.",
    "accepted_answers": [
      "It was amazing! I felt like I was in another world.",
      "It was incredible! I felt like being in a different world.",
      "Amazing! It felt like I was in another reality.",
      "It was fantastic! I felt transported to another world.",
      "Incredible! It was like being in a completely different place.",
      "It was awesome! I felt like I was somewhere else entirely."
    ]
  },
  {
    "alex": "Have you played any specific VR games?",
    "cz_reply": "Ano, hrál jsem Beat Saber a nějakou střílečku.",
    "accepted_answers": [
      "Yes, I've played Beat Saber and some shooter game.",
      "I played Beat Saber and a shooting game.",
      "Yes, I've tried Beat Saber and some action game.",
      "I've played Beat Saber and a first-person shooter.",
      "Yes, Beat Saber and some combat game.",
      "I experienced Beat Saber and a shooting game."
    ]
  },
  {
    "alex": "Have you considered buying your own VR headset?",
    "cz_reply": "Ano, ale je to zatím moc drahé.",
    "accepted_answers": [
      "Yes, but it's too expensive for now.",
      "I've thought about it, but it's too costly.",
      "Yes, but the price is too high right now.",
      "I've considered it, but it's beyond my budget.",
      "Yes, but I can't afford it yet.",
      "I'd like to, but it's too expensive currently."
    ]
  },
  {
    "alex": "Have you seen any VR videos on YouTube?",
    "cz_reply": "Ano, sledoval jsem recenze a gameplay videa.",
    "accepted_answers": [
      "Yes, I've watched reviews and gameplay videos.",
      "I've seen review videos and game footage.",
      "Yes, I've watched VR reviews and gaming videos.",
      "I've viewed reviews and gameplay demonstrations.",
      "Yes, I've seen review content and game videos.",
      "I've watched evaluation videos and game footage."
    ]
  },
  {
    "alex": "Have you heard about the metaverse?",
    "cz_reply": "Ano, ale pořád tomu úplně nerozumím.",
    "accepted_answers": [
      "Yes, but I still don't fully understand it.",
      "I've heard of it, but I don't completely get it.",
      "Yes, but I'm still confused about what it is.",
      "I've heard about it, but it's not entirely clear to me.",
      "Yes, but I don't grasp the concept completely.",
      "I know about it, but I'm still learning what it means."
    ]
  },
  {
    "alex": "Have you tried any VR social experiences?",
    "cz_reply": "Ne, zatím jen hry. Ale zní to zajímavě.",
    "accepted_answers": [
      "No, just games so far. But it sounds interesting.",
      "I haven't, only games. But that sounds intriguing.",
      "No, only gaming. But it sounds fascinating.",
      "Not yet, just games. But that sounds cool.",
      "I haven't tried social VR, only games. Sounds interesting though.",
      "No, I've only done gaming. But that sounds appealing."
    ]
  },
  {
    "alex": "Have you experienced any motion sickness in VR?",
    "cz_reply": "Trochu ano, hlavně při rychlém pohybu.",
    "accepted_answers": [
      "A little bit, especially during fast movement.",
      "Yes, somewhat, particularly with rapid motion.",
      "A bit, mainly when moving quickly.",
      "Slightly, especially during fast-paced scenes.",
      "A little, particularly with quick movements.",
      "Yes, a bit, especially when there's rapid motion."
    ]
  },
  {
    "alex": "Have you heard about VR fitness apps?",
    "cz_reply": "Ano, slyšel jsem, že se při tom dá i cvičit.",
    "accepted_answers": [
      "Yes, I've heard you can exercise with them.",
      "I've heard that you can work out using VR.",
      "Yes, I know you can exercise through VR apps.",
      "I've heard VR can be used for fitness.",
      "Yes, I've learned you can get fit with VR.",
      "I've heard VR offers workout opportunities."
    ]
  },
  {
    "alex": "Do you think VR will become more popular in the future?",
    "cz_reply": "Určitě ano, technologie se stále zlepšuje.",
    "accepted_answers": [
      "Definitely yes, the technology keeps improving.",
      "Absolutely, technology is constantly getting better.",
      "For sure, the tech is continuously advancing.",
      "Certainly, technology keeps evolving.",
      "Yes definitely, technology is always improving.",
      "Absolutely, technological progress continues."
    ]
  }
]
