{
  "lyrics": [
    "It's been a long day without you, my friend",
    "And I'll tell you all about it when I see you again",
    "We've come a long way from where we began",
    "Oh, I'll tell you all about it when I see you again",
    "When I see you again",
    "Damn, who knew?",
    "All the planes we flew, good things we been through",
    "That I'd be standin' right here talkin' to you",
    "'Bout another path, I know we loved to hit the road and laugh",
    "But somethin' told me that it wouldn't last",
    "Had to switch up, look at things different, see the bigger picture",
    "Those were the days, hard work forever pays",
    "Now I see you in a better place (see you in a better place)",
    "Uh",
    "How can we not talk about family when family's all that we got?",
    "Everythin' I went through, you were standin' there by my side",
    "And now you gon' be with me for the last ride",
    "It's been a long day without you, my friend",
    "And I'll tell you all about it when I see you again (I'll see you again)",
    "We've come a long way (yeah, we came a long way)",
    "From where we began (you know where we started)",
    "Oh, I'll tell you all about it when I see you again (let me tell you)",
    "When I see you again",
    "Oh, oh",
    "Ooh (yeah)",
    "First, you both go out your way and the vibe is feelin' strong",
    "And what's small turned to a friendship, a friendship turned to a bond",
    "And that bond'll never be broken, the love will never get lost",
    "(The love never get lost)",
    "And when brotherhood come first, then the line'll never be crossed",
    "Established it on our own when that line had to be drawn",
    "And that line is what we reached, so remember me when I'm gone",
    "(Remember me when I'm gone)",
    "How can we not talk about family when family's all that we got?",
    "Everythin' I went through, you were standin' there by my side",
    "And now you gon' be with me for the last ride",
    "So let the light guide your way, yeah",
    "Hold every memory as you go",
    "And every road you take",
    "Will always lead you home, home",
    "It's been a long day without you, my friend",
    "And I'll tell you all about it when I see you again",
    "We've come a long way from where we began",
    "Oh, I'll tell you all about it when I see you again",
    "When I see you again",
    "Oh (uh), oh (yeah-yeah, yeah)",
    "Ooh (yo, yo, uh)",
    "When I see you again (see you again, yeah, yeah)",
    "Oh (yeah), oh (yeah, yeah, oh-oh)",
    "Ooh (uh-huh, yup)",
    "When I see you again"
  ],
  "translations": [
    "Byl to dlouhý den bez tebe, můj příteli",
    "A všechno ti o tom povím, až tě zase uvidím",
    "Ušli jsme dlouhou cestu od místa, kde jsme začali",
    "Oh, všechno ti o tom povím, až tě zase uvidím",
    "Až tě zase uvidím",
    "Sakra, kdo by to byl řekl?",
    "Všechna ta letadla, kterými jsme letěli, všechny ty dobré věci, co jsme zažili",
    "Že budu stát právě tady a mluvit s tebou",
    "O jiné cestě, vím, že jsme rádi vyráželi na cesty a smáli se",
    "Ale něco mi říkalo, že to nevydrží",
    "Musel jsem to změnit, dívat se na věci jinak, vidět větší obrázek",
    "To byly ty dny, tvrdá práce se vždycky vyplatí",
    "Teď tě vidím na lepším místě (vidím tě na lepším místě)",
    "Uh",
    "Jak bychom nemohli mluvit o rodině, když rodina je vše, co máme?",
    "Vším, čím jsem prošel, jsi stál po mém boku",
    "A teď budeš se mnou na poslední jízdě",
    "Byl to dlouhý den bez tebe, můj příteli",
    "A všechno ti o tom povím, až tě zase uvidím (zase tě uvidím)",
    "Ušli jsme dlouhou cestu (jo, ušli jsme dlouhou cestu)",
    "Od místa, kde jsme začali (víš, kde jsme začali)",
    "Oh, všechno ti o tom povím, až tě zase uvidím (nech mě ti to říct)",
    "Až tě zase uvidím",
    "Oh, oh",
    "Ooh (jo)",
    "Nejdřív oba jdete svou cestou a ta energie je silná",
    "A z maličkosti vzniklo přátelství, z přátelství pouto",
    "A to pouto nikdy nebude zlomeno, láska se nikdy neztratí",
    "(Láska se nikdy neztratí)",
    "A když je na prvním místě bratrství, ta hranice nikdy nebude překročena",
    "Vytvořili jsme to sami, když tu hranici bylo třeba nakreslit",
    "A tu hranici jsme dosáhli, tak si na mě vzpomeň, až budu pryč",
    "(Vzpomínej na mě, až budu pryč)",
    "Jak bychom nemohli mluvit o rodině, když rodina je vše, co máme?",
    "Vším, čím jsem prošel, jsi stál po mém boku",
    "A teď budeš se mnou na poslední jízdě",
    "Tak ať ti světlo ukazuje cestu, jo",
    "Uchovávej každou vzpomínku, když půjdeš",
    "A každá cesta, kterou se vydáš",
    "Tě vždycky dovede domů, domů",
    "Byl to dlouhý den bez tebe, můj příteli",
    "A všechno ti o tom povím, až tě zase uvidím",
    "Ušli jsme dlouhou cestu od místa, kde jsme začali",
    "Oh, všechno ti o tom povím, až tě zase uvidím",
    "Až tě zase uvidím",
    "Oh (uh), oh (yeah-yeah, yeah)",
    "Ooh (yo, yo, uh)",
    "Až tě zase uvidím (zase tě uvidím, jo, jo)",
    "Oh (jo), oh (jo, jo, oh-oh)",
    "Ooh (uh-huh, yup)",
    "Až tě zase uvidím"
  ]
}