{
  "A1": [
    "Hello, my name is Sarah.",
    "I like cats and dogs.",
    "Today is a nice day.",
    "I am from London.",
    "This is my book.",
    "I have two sisters.",
    "The cat is black.",
    "I drink coffee every morning.",
    "She goes to school.",
    "We live in a big house.",
    "I am twenty years old.",
    "My car is red.",
    "The weather is cold today.",
    "I love pizza and ice cream.",
    "My brother plays football.",
    "She works in a hospital.",
    "We have three children.",
    "The dog is very friendly.",
    "I speak English and Czech.",
    "My mother cooks delicious food.",
    "The book is on the table.",
    "I go to work by bus.",
    "She likes to read magazines.",
    "We watch TV in the evening.",
    "My father is a teacher.",
    "The flowers are beautiful.",
    "I eat breakfast at seven.",
    "She has long brown hair.",
    "We live near the park.",
    "The movie was very good."
  ],
  "A2": [
    "I usually wake up at seven o'clock in the morning.",
    "My favorite hobby is reading mystery novels.",
    "Last weekend I visited my grandmother in the countryside.",
    "Could you please help me with this heavy bag?",
    "The weather forecast says it will rain tomorrow.",
    "I'm planning to learn Spanish next year.",
    "There are many interesting museums in this city.",
    "She has been working here for three years.",
    "I don't understand why he didn't come to the party.",
    "Would you like to have dinner with us tonight?",
    "I've been studying English for two years now.",
    "The restaurant serves excellent Italian food.",
    "We should probably leave early to avoid traffic.",
    "I'm looking forward to my vacation next month.",
    "She decided to change her career completely.",
    "The concert was cancelled due to bad weather.",
    "I need to buy some groceries on my way home.",
    "Have you ever been to New York City before?",
    "The new shopping center opens next weekend.",
    "I'm trying to lose weight by eating healthier.",
    "We used to live in a small apartment downtown.",
    "The children were playing happily in the garden.",
    "I'd rather stay home than go out tonight.",
    "She's much better at math than I am.",
    "We're having a barbecue party this Saturday.",
    "I forgot to bring my umbrella this morning.",
    "The train arrives at platform three every hour.",
    "She's been learning to drive for six months.",
    "I can't find my keys anywhere in the house.",
    "We're planning to renovate our kitchen soon."
  ],
  "B1": [
    "Despite the challenging circumstances, she managed to complete the project successfully.",
    "The government has announced new environmental policies to reduce carbon emissions.",
    "I'm considering changing my career path because I'm not satisfied with my current job.",
    "The documentary we watched last night was incredibly thought-provoking and educational.",
    "Although he had never traveled abroad before, he adapted quickly to the new culture.",
    "The company's profits have increased significantly since they implemented the new strategy.",
    "She's been studying medicine for five years and will graduate next summer.",
    "The ancient castle, which was built in the 12th century, attracts thousands of tourists annually.",
    "I would have called you earlier if I had known about the meeting cancellation.",
    "The research team discovered that regular exercise can improve cognitive function in elderly people.",
    "The economic crisis has had a devastating impact on small businesses throughout the region.",
    "Scientists are working tirelessly to develop more sustainable energy solutions for the future.",
    "The majority of students expressed their dissatisfaction with the new examination system.",
    "Cultural differences can sometimes lead to misunderstandings in international business negotiations.",
    "The medical breakthrough offers hope for millions of patients suffering from this rare disease.",
    "Environmental activists are demanding immediate action to protect endangered species from extinction.",
    "The technological revolution has fundamentally changed the way we communicate and work.",
    "Social media platforms have transformed how young people interact and share information.",
    "The urban planning committee is considering several proposals for the city center redevelopment.",
    "Educational reforms are necessary to prepare students for the challenges of the modern workplace.",
    "Climate change researchers warn that immediate action is required to prevent catastrophic consequences.",
    "The cultural festival celebrates the rich heritage and traditions of various ethnic communities.",
    "Modern architecture combines functionality with aesthetic appeal to create inspiring living spaces.",
    "The psychological effects of prolonged isolation can have serious implications for mental health.",
    "International cooperation is essential for addressing global challenges such as poverty and hunger.",
    "The pharmaceutical industry invests billions of dollars annually in research and development.",
    "Renewable energy sources are becoming increasingly cost-effective compared to fossil fuels.",
    "The hospitality industry has been severely affected by the recent changes in travel regulations.",
    "Digital literacy has become a fundamental skill required in almost every profession today.",
    "The conservation program aims to restore natural habitats and protect biodiversity."
  ],
  "B2": [
    "The unprecedented technological advancements of the 21st century have fundamentally transformed how we communicate and interact.",
    "Researchers have been investigating the correlation between sleep deprivation and decreased immune system functionality.",
    "The multinational corporation's controversial decision to relocate their headquarters sparked intense debate among stakeholders.",
    "Had I been more conscientious about my financial planning, I wouldn't have encountered such difficulties during the recession.",
    "The intricate relationship between climate change and biodiversity loss requires comprehensive international cooperation.",
    "Despite having extensive experience in the field, she found herself struggling with the complexity of the theoretical framework.",
    "The philosopher's argument regarding the nature of consciousness has been both praised and criticized by contemporary scholars.",
    "The implementation of artificial intelligence in healthcare has the potential to revolutionize diagnostic procedures.",
    "Not only did the exhibition showcase remarkable artistic talent, but it also raised awareness about social justice issues.",
    "The economic implications of the trade agreement are far more nuanced than initially anticipated by policy makers.",
    "The proliferation of misinformation on social media platforms has undermined public trust in traditional journalism.",
    "Neuroplasticity research demonstrates that the human brain retains its capacity for adaptation throughout adulthood.",
    "The geopolitical ramifications of emerging technologies are reshaping international relations and security paradigms.",
    "Sustainable urban development requires a delicate balance between economic growth and environmental preservation.",
    "The psychological mechanisms underlying decision-making processes are influenced by numerous cognitive biases.",
    "Biotechnology innovations have opened unprecedented opportunities for personalized medicine and targeted therapies.",
    "The democratization of information through digital platforms has both empowered citizens and created new challenges.",
    "Quantum computing represents a paradigm shift that could revolutionize cryptography and data processing capabilities.",
    "The socioeconomic disparities exacerbated by globalization demand innovative policy interventions and solutions.",
    "Archaeological evidence suggests that ancient civilizations possessed sophisticated understanding of astronomical phenomena.",
    "The epistemological foundations of scientific methodology continue to evolve in response to new discoveries.",
    "Interdisciplinary collaboration between humanities and sciences is crucial for addressing complex societal problems.",
    "The philosophical implications of consciousness studies challenge our fundamental assumptions about human nature.",
    "Machine learning algorithms are increasingly being deployed in critical decision-making processes across industries.",
    "The anthropological perspective on cultural evolution provides insights into human adaptation and social development.",
    "Genetic engineering technologies raise profound ethical questions about the limits of scientific intervention.",
    "The macroeconomic effects of monetary policy decisions reverberate throughout global financial markets.",
    "Postmodernist literary criticism has fundamentally altered our understanding of textual interpretation and meaning.",
    "The phenomenological approach to understanding human experience emphasizes subjective consciousness and perception.",
    "Cybersecurity threats in the digital age require sophisticated strategies for protecting sensitive information."
  ],
  "C1": [
    "The epistemological foundations of modern scientific inquiry are predicated upon empirical observation and rigorous methodological frameworks.",
    "Notwithstanding the apparent contradictions inherent in postmodern philosophical discourse, many scholars continue to find valuable insights.",
    "The juxtaposition of traditional pedagogical approaches with contemporary digital learning methodologies necessitates careful consideration of efficacy.",
    "Were it not for the serendipitous discovery of penicillin, countless lives would have been lost to bacterial infections.",
    "The proliferation of misinformation in digital media has undermined public trust in established institutions and expert knowledge.",
    "The anthropological implications of globalization extend far beyond mere economic considerations to encompass cultural homogenization.",
    "Scarcely had the negotiations commenced when it became apparent that fundamental ideological differences would impede progress.",
    "The ramifications of quantum computing for cryptographic security protocols are both promising and potentially catastrophic.",
    "The paradoxical nature of human consciousness continues to elude comprehensive scientific explanation despite remarkable technological advances.",
    "Only through sustained interdisciplinary collaboration can we hope to address the multifaceted challenges of climate change mitigation.",
    "The hermeneutical tradition in philosophy emphasizes the interpretive nature of human understanding and meaning-making.",
    "Phenomenological investigations into the structure of experience reveal the intricate relationship between consciousness and temporality.",
    "The poststructuralist critique of linguistic determinism challenges conventional notions of stable meaning and authorial intention.",
    "Deconstructionist literary theory exposes the inherent instability and contradictions within seemingly coherent textual narratives.",
    "The dialectical relationship between individual agency and social determinism remains a contentious issue in sociological theory.",
    "Cognitive neuroscience research elucidates the neural correlates of higher-order mental processes and executive functions.",
    "The ontological status of mathematical objects continues to generate debate among philosophers of mathematics and logic.",
    "Psychoanalytic theory posits that unconscious desires and repressed memories significantly influence conscious behavior patterns.",
    "The phenomenology of perception demonstrates the active, constructive nature of sensory experience and spatial awareness.",
    "Evolutionary psychology attempts to explain contemporary human behavior through the lens of adaptive mechanisms.",
    "The sociology of knowledge examines how social factors influence the production and validation of scientific knowledge.",
    "Critical discourse analysis reveals the ideological underpinnings embedded within seemingly neutral linguistic structures.",
    "The philosophy of mind grapples with the fundamental question of how mental states relate to physical brain processes.",
    "Postcolonial literature challenges Eurocentric perspectives and gives voice to marginalized cultural narratives.",
    "The aesthetics of modernist art reflects the fragmentation and alienation characteristic of industrial society.",
    "Existentialist philosophy emphasizes individual responsibility and the authentic creation of meaning in an absurd universe.",
    "The pragmatist tradition in American philosophy prioritizes practical consequences over abstract theoretical considerations.",
    "Feminist epistemology critiques the androcentric biases inherent in traditional approaches to knowledge production.",
    "The linguistic turn in philosophy redirected attention toward language as the primary medium of human thought.",
    "Bioethics addresses the moral implications of advancing medical technologies and their impact on human dignity."
  ],
  "C2": [
    "The ineluctable convergence of artificial intelligence and human cognition portends a fundamental reconfiguration of epistemological paradigms.",
    "Notwithstanding the ostensible legitimacy of their arguments, the proponents of this theory have failed to address the inherent contradictions.",
    "The labyrinthine complexities of international jurisprudence are further exacerbated by the inexorable proliferation of transnational governance.",
    "Had the researchers anticipated the deleterious ramifications of their methodology, they might have reconsidered their experimental design.",
    "The perspicacious analysis of socioeconomic stratification reveals the insidious mechanisms by which inequality perpetuates itself.",
    "The ineffable quality of aesthetic experience defies reductive explanations and demands a more nuanced hermeneutical approach.",
    "Scarcely can one overstate the profound implications of quantum entanglement for our understanding of temporal and spatial relationships.",
    "The proliferation of algorithmic decision-making systems raises fundamental questions about human agency and moral responsibility.",
    "The recondite nature of consciousness studies necessitates an interdisciplinary synthesis of neuroscience, philosophy, and computational theory.",
    "Only through rigorous phenomenological investigation can we begin to apprehend the lived experience of intersubjective meaning-making.",
    "The apotheosis of technological determinism threatens to subsume human autonomy beneath the inexorable logic of algorithmic optimization.",
    "The palimpsestic nature of cultural memory reveals the sedimented layers of historical experience inscribed within collective consciousness.",
    "The chiasmic relationship between subject and object in phenomenological inquiry eludes the binary oppositions of traditional metaphysics.",
    "The hermeneutical circle demonstrates the inescapable circularity inherent in all interpretive endeavors and understanding.",
    "The apophatic tradition in mystical theology emphasizes the radical unknowability of the divine through negative articulation.",
    "The rhizomatic structure of postmodern thought resists hierarchical organization and embraces multiplicities of meaning.",
    "The catachrestic use of metaphorical language in philosophical discourse reveals the inadequacy of literal expression.",
    "The aporetic nature of justice, as conceptualized by Derrida, highlights the undecidable tension between law and ethics.",
    "The synecdochic relationship between part and whole in literary representation complicates traditional notions of mimetic fidelity.",
    "The ekphrastic tradition in poetry demonstrates the complex interplay between visual and verbal modes of artistic expression.",
    "The metaleptic structure of narrative temporality disrupts linear chronology and challenges conventional causality.",
    "The pharmakon, as both remedy and poison, exemplifies the undecidable nature of linguistic signification.",
    "The différance that underlies all linguistic meaning perpetually defers the possibility of absolute presence.",
    "The spectrality of textual meaning haunts every attempt at definitive interpretation and semantic closure.",
    "The anamnesis of philosophical inquiry recalls forgotten truths while simultaneously revealing their constructedness.",
    "The parallax view exposes the irreducible gap between subjective perspectives and objective reality.",
    "The symptomal reading of ideological texts reveals the unconscious contradictions that structure dominant discourse.",
    "The aleatory nature of historical contingency undermines teleological narratives of inevitable progress.",
    "The mise en abyme of self-reflexive representation creates infinite regress and interpretive vertigo.",
    "The jouissance of aesthetic encounter exceeds the boundaries of rational comprehension and linguistic articulation."
  ]
}
