{
  "topic": "complaining",
  "characters": [
    "Alex",
    "Uživatel"
  ],
  "dialogue": [
    {
      "speaker": "Alex",
      "cz": "Dobrý den, vítejte v naší restauraci. Máte rezervaci?",
      "en": "Good afternoon, welcome to our restaurant. Do you have a reservation?"
    },
    {
      "speaker": "Uživatel",
      "cz": "Pozdrav a řekni, že nemáš rezervaci, ale chtěl bys stůl pro jednoho.",
      "en": [
        "Hi, I don't have a reservation, but I'd like a table for one.",
        "Hello, no reservation, but is there a table for one person?",
        "Hi! Just me, do you have a free table?",
        "Good afternoon, I would like a table for one, please.",
        "Hello, is it possible to get a table for one without a reservation?",
        "Hi, could I get a table for just myself?",
        "Hi, I hope it's okay that I don't have a reservation. Is there a table for one?",
        "Hello, I'm alone. Do you have any free tables?",
        "Hi, I'm looking for a table for one, no reservation.",
        "Hello, do you have a spot for just one person?",
        "Hi there, table for one if possible?",
        "Good afternoon, I'm by myself today. Any available tables?",
        "Hello, I don't have a booking but I'm hoping for a table for one.",
        "Hi, is there any chance of getting a table for one person?",
        "Hello, I'm dining alone today. Do you have space?"
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Jistě, pojďte prosím za mnou. Tady je jídelní lístek.",
      "en": "Of course, please follow me. Here's the menu."
    },
    {
      "speaker": "Uživatel",
      "cz": "Po chvíli si stěžuj, že jídlo je studené.",
      "en": [
        "Excuse me, my food is cold.",
        "Sorry, but my meal isn't hot.",
        "Can I say something? My dish is cold.",
        "I'm sorry, but my food is not warm enough.",
        "Excuse me, could you please warm up my food? It's a bit cold.",
        "Sorry to bother you, but my meal is cold.",
        "I think my food was served cold.",
        "Could you please check my dish? It's not hot.",
        "My meal is not as warm as I expected.",
        "Excuse me, this food is not hot.",
        "I hate to complain, but my food is cold.",
        "Sorry, but I think my meal needs to be reheated.",
        "Excuse me, my dish seems to have gone cold.",
        "I'm afraid my food isn't warm enough.",
        "Could I mention that my meal is quite cold?",
        "Sorry to interrupt, but my food is cold.",
        "I don't want to be difficult, but my meal is cold."
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Omlouvám se, hned vám přinesu nové.",
      "en": "I’m so sorry. I’ll bring you a new one right away."
    },
    {
      "speaker": "Uživatel",
      "cz": "Poděkuj a řekni, že jinak všechno ostatní je v pořádku.",
      "en": [
        "Thank you. Everything else is fine.",
        "Thanks. Apart from that, everything's okay.",
        "Thank you, the rest is good.",
        "Thank you so much, everything else is perfect.",
        "Thanks, I appreciate your help. Everything else is alright.",
        "Thank you, I'm happy with everything else.",
        "Thanks, the rest of the meal was great.",
        "Thank you, I have no other complaints.",
        "Thanks for your help, everything else is nice.",
        "Thank you, the service has been good otherwise.",
        "I really appreciate this. Everything else has been wonderful.",
        "Thanks, apart from this issue, everything is excellent.",
        "Thank you for being so understanding. The rest is perfect.",
        "I'm grateful for your quick response. Everything else is great.",
        "Thanks, the restaurant and service are otherwise fantastic."
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Děkuji za pochopení. Nové jídlo bude za pár minut.",
      "en": "Thank you for your understanding. The new dish will be ready in a few minutes."
    },
    {
      "speaker": "Uživatel",
      "cz": "Po jídle požádej o účet.",
      "en": [
        "Can I have the bill, please?",
        "Could you bring me the check, please?",
        "I'd like to pay, could I get the bill?",
        "Excuse me, could I have the bill?",
        "Could I settle my bill, please?",
        "Can you bring me the bill?",
        "May I have the check, please?",
        "Could I pay now, please?",
        "Could you please give me the bill?",
        "I'd like to pay, could I have the check?",
        "When you have a moment, could I get the bill?",
        "I'm ready to pay. Could I have the bill?",
        "Could I get the check when you're ready?",
        "I'd like to settle up, please.",
        "Could I have the bill when convenient?"
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Tady je účet. Doufám, že příště bude všechno perfektní.",
      "en": "Here’s your bill. I hope everything will be perfect next time."
    },
    {
      "speaker": "Uživatel",
      "cz": "Rozluč se a řekni, že se možná vrátíš.",
      "en": [
        "Goodbye! I might come back again.",
        "Thanks, see you next time maybe!",
        "Bye, I'll give it another try next time.",
        "Goodbye, I hope to come back soon.",
        "Thanks, I might come back another time.",
        "Bye, I hope to see you again.",
        "Goodbye, I'll think about coming back.",
        "Thanks, maybe I'll come back next time.",
        "Bye, I hope everything will be better next time.",
        "Goodbye, I might give it another try.",
        "Take care, I may return in the future.",
        "Thanks for sorting it out. I'll consider coming back.",
        "Goodbye, perhaps I'll visit again sometime.",
        "Thanks for your help. I might return.",
        "See you later, I'll think about coming back."
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Měj se hezky a děkujeme, že jste přišel.",
      "en": "Take care and thank you for coming."
    },
    {
      "speaker": "Alex",
      "cz": "(v obchodě) Dobrý den, jak vám mohu pomoci?",
      "en": "(in store) Hello, how can I help you?"
    },
    {
      "speaker": "Uživatel",
      "cz": "Řekni, že si koupil oblečení včera, ale má vadu.",
      "en": [
        "Hi, I bought this shirt yesterday but it has a defect.",
        "Hello, I bought this yesterday and noticed a flaw.",
        "Excuse me, this has a tear and I just bought it.",
        "Hi, I purchased this item yesterday, but it's damaged.",
        "Hello, I bought this shirt yesterday, but it's not in good condition.",
        "Hi, I need to return this item, it's faulty.",
        "Hello, I bought this yesterday, but it's not what I expected.",
        "Hi, I have a problem with this item, it's defective.",
        "Hello, I bought this shirt yesterday, but it's not right.",
        "Hi, I need to exchange this item, it's not in good condition.",
        "Hello, I purchased this yesterday but there's something wrong with it.",
        "Hi, I bought this item yesterday and it has a manufacturing defect.",
        "Excuse me, I bought this yesterday but it's damaged.",
        "Hello, this item I bought yesterday has a problem.",
        "Hi, I need help with this purchase from yesterday - it's faulty."
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Opravdu? Můžu se podívat? Máte účtenku?",
      "en": "Really? May I take a look? Do you have the receipt?"
    },
    {
      "speaker": "Uživatel",
      "cz": "Řekni, že máš účtenku a ukaž ji.",
      "en": [
        "Yes, I have it here.",
        "Sure, here's the receipt.",
        "Yes, I kept it. Here you go.",
        "Of course, I have the receipt right here.",
        "Yes, I have it with me. Let me show you.",
        "Here is the receipt.",
        "I have the receipt, let me get it.",
        "Yes, I kept the receipt. Here it is.",
        "Of course, I have the receipt. Here you are.",
        "Yes, I have it. Let me show it to you.",
        "Absolutely, here's my receipt.",
        "Yes, I always keep my receipts. Here it is.",
        "Of course, let me find it for you.",
        "Yes, I have the receipt right here in my wallet.",
        "Sure, I brought it with me. Here you go."
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Děkuji. Můžeme vám nabídnout výměnu nebo vrácení peněz.",
      "en": "Thank you. We can offer you an exchange or a refund."
    },
    {
      "speaker": "Uživatel",
      "cz": "Řekni, že bys radši peníze zpět.",
      "en": [
        "I'd prefer a refund, please.",
        "I'd like my money back, if that's okay.",
        "A refund would be better for me.",
        "I would prefer a refund, thank you.",
        "I'd rather have a refund, please.",
        "A refund is what I would prefer.",
        "I would like a refund, if possible.",
        "I'd like to get a refund, please.",
        "A refund would be great, thank you.",
        "I would prefer to get a refund.",
        "Could I get my money back instead?",
        "I think a refund would be the best option.",
        "I'd rather get a refund than exchange it.",
        "A full refund would be ideal, please.",
        "I don't need a replacement, just a refund please."
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Samozřejmě. Vrátíme peníze na vaši kartu během 3 pracovních dnů.",
      "en": "Of course. We'll refund the money to your card within 3 business days."
    },
    {
      "speaker": "Uživatel",
      "cz": "Poděkuj a řekni, že si toho vážíš.",
      "en": [
        "Thank you, I appreciate it.",
        "Thanks a lot, that's very helpful.",
        "Thank you, that means a lot.",
        "I appreciate your help, thank you.",
        "Thanks, I really appreciate it.",
        "Thank you, that's very kind of you.",
        "I'm grateful for your help, thank you.",
        "Thanks, I appreciate your assistance.",
        "Thank you, you've been very helpful.",
        "I appreciate your time, thank you.",
        "Thanks so much for your understanding.",
        "I really value your customer service, thank you.",
        "Thank you for handling this so professionally.",
        "I'm grateful for your quick resolution, thanks.",
        "Thank you for making this so easy."
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Rádo se stalo. Doufáme, že vás příště nezklameme.",
      "en": "You're welcome. We hope not to disappoint you next time."
    }
  ]
}
