{
  "topic": "directions",
  "characters": [
    "Alex",
    "Uživatel"
  ],
  "dialogue": [
    {
      "speaker": "Alex",
      "cz": "Ahoj! Vypadáš, že něco hledáš. Potřebuješ pomoct?",
      "en": "Hi! You look like you're looking for something. Do you need help?"
    },
    {
      "speaker": "Uživatel",
      "cz": "Pozdrav a řekni, že hledáš autobusovou zastávku.",
      "en": [
        "Hello! Yes, I'm looking for the bus stop.",
        "Hi! Do you know where the bus stop is?",
        "Hello, I need to find a bus stop.",
        "Hi! I'm trying to get to a bus stop.",
        "Hey, do you know where I can catch the bus?",
        "Hi, could you tell me where the nearest bus stop is?",
        "Hello, I'm looking for a place to catch the bus.",
        "Excuse me, do you know where the bus stop is?",
        "Hi, I'm trying to find the bus stop in this area.",
        "Hello, is there a bus stop nearby?",
        "Hi, where can I get the bus from here?",
        "Excuse me, I need directions to the bus stop.",
        "Hi, could you help me find the bus stop?",
        "Hello, I'm searching for the bus stop. Can you help me?",
        "Hi there! I'm a bit lost - where's the bus stop?",
        "Hello, I'm new here. Could you point me to the bus stop?",
        "Hi, I'm trying to figure out where to catch the bus.",
        "Excuse me, I need to find the closest bus stop.",
        "Hello, which way is the bus stop?",
        "Hi, I'm looking for public transport - where's the bus stop?"
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Jasně, rád pomůžu. Kam přesně chceš jet?",
      "en": "Sure, I’ll be happy to help. Where exactly do you want to go?"
    },
    {
      "speaker": "Uživatel",
      "cz": "Řekni, že jedeš do centra města.",
      "en": [
        "I'm going to the city centre.",
        "I need to get to the city center.",
        "To the city centre, please.",
        "I'm heading to the city center.",
        "I want to go to downtown.",
        "I'm trying to get to the center of town.",
        "I'd like to go to the city centre.",
        "I'm looking to get to downtown.",
        "I want to go to the main part of the city.",
        "I need to go to the city centre area.",
        "I'm heading downtown.",
        "I need to get to the town center.",
        "I'm going to the central part of the city.",
        "I want to reach the city center.",
        "I'm traveling to downtown area."
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Rozumím. Do centra jede autobus číslo 24. Zastávka je hned za rohem vedle kavárny.",
      "en": "Got it. Bus number 24 goes to the city centre. The stop is just around the corner next to the café."
    },
    {
      "speaker": "Uživatel",
      "cz": "Zeptej se, kdy jede další autobus.",
      "en": [
        "When is the next bus?",
        "When is the next bus arriving?",
        "What time does the next bus arrive?",
        "Do you know when the next bus comes?",
        "How long until the next bus?",
        "When does the next bus leave?",
        "Could you tell me when the next bus is?",
        "Excuse me, when does the next bus get here?",
        "Do you know how soon the next bus comes?",
        "How much time until the next bus arrives?",
        "Can you tell me when the next bus will be here?",
        "What time is the next bus due?",
        "How often do the buses run?",
        "Do you know the bus schedule?",
        "When can I expect the next bus?",
        "Is there a regular timetable?",
        "How frequently do buses come?"
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Další autobus přijede za deset minut. Mívá ale někdy zpoždění, tak doporučuju být tam trochu dřív.",
      "en": "The next bus will arrive in ten minutes. It’s sometimes a bit late, so I recommend getting there a little early."
    },
    {
      "speaker": "Uživatel",
      "cz": "Poděkuj a zeptej se, kde si můžeš koupit jízdenku.",
      "en": [
        "Thanks! Where can I buy a ticket?",
        "Thank you. Where do I get a ticket?",
        "Thanks a lot! Is there a place to buy a ticket nearby?",
        "Thank you! How can I get a ticket?",
        "Where do I purchase a bus ticket?",
        "Excuse me, where can I buy a ticket for the bus?",
        "Hi, could you tell me where I can buy a ticket?",
        "Thanks, where is the ticket office?",
        "I need to buy a ticket, where can I do that?",
        "Can you tell me where to buy a ticket for the bus?",
        "Thanks! Do I need to buy a ticket in advance?",
        "Thank you! Where's the best place to get a ticket?",
        "Thanks! Is there a ticket machine somewhere?",
        "Thank you! Can I buy a ticket on the bus?",
        "Thanks! What's the easiest way to get a ticket?"
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Jízdenku si můžeš koupit v automatu u zastávky nebo přes mobilní aplikaci. Obě možnosti jsou jednoduché.",
      "en": "You can buy a ticket at the machine by the bus stop or via a mobile app. Both are easy to use."
    },
    {
      "speaker": "Uživatel",
      "cz": "Zeptej se, kolik to stojí a jestli se dá platit kartou.",
      "en": [
        "How much is it? Can I pay by card?",
        "What's the price of the ticket? Can I use a card?",
        "How much does a ticket cost? And can I pay with a card?",
        "Is it possible to pay with a card? And how much is the ticket?",
        "Do you know how much it is and if card payments are accepted?",
        "Excuse me, how much is the ticket and can I pay by card?",
        "Hi, could you tell me the price of the ticket and if I can pay with a card?",
        "Thanks, how much is the ticket and can I pay with my card?",
        "I need to know the price of the ticket and if I can pay with a card.",
        "Can you tell me the price of the ticket and if card payments are accepted?",
        "What does a ticket cost and do they take cards?",
        "How much should I expect to pay? Can I use my credit card?",
        "What's the fare and is contactless payment available?",
        "Do you know the ticket price and payment options?",
        "How much for a single ticket and can I pay electronically?"
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Jedna jízdenka stojí třicet korun. Platba kartou je možná jak v automatu, tak v aplikaci.",
      "en": "One ticket costs thirty crowns. You can pay by card both at the machine and in the app."
    },
    {
      "speaker": "Uživatel",
      "cz": "Zeptej se, jak dlouho platí jízdenka.",
      "en": [
        "How long is the ticket valid for?",
        "How long does the ticket last?",
        "Is there a time limit on the ticket?",
        "How long can I use the ticket?",
        "What's the ticket's validity?",
        "Excuse me, how long is the ticket valid?",
        "Hi, could you tell me how long the ticket is valid for?",
        "Thanks, how long does the ticket last?",
        "I need to know how long the ticket is valid.",
        "Can you tell me the ticket's validity period?",
        "How much time do I have once I buy the ticket?",
        "What's the time limit on a single ticket?",
        "How long before the ticket expires?",
        "Is it valid for the whole day?",
        "Do I need to use it within a certain time?"
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Platí 45 minut od označení. Můžeš s ní i přestupovat.",
      "en": "It’s valid for 45 minutes after validation. You can use it to change buses too."
    },
    {
      "speaker": "Uživatel",
      "cz": "Poděkuj a rozluč se.",
      "en": [
        "Thank you so much! Have a nice day!",
        "Thanks a lot. Goodbye!",
        "Thank you, I appreciate your help. Bye!",
        "Thanks, have a great day!",
        "Thank you very much! See you!",
        "Thanks for your help! Have a good one!",
        "I appreciate your help. Goodbye!",
        "Thanks a lot! Have a nice day!",
        "Thank you so much for your help!",
        "You're very kind! Have a great day!",
        "I really appreciate your time. Goodbye!",
        "Thanks for being so helpful! Bye!",
        "You've been amazing, thank you! Have a good day!",
        "I'm so grateful for your help. See you later!",
        "Thanks for making this so easy! Goodbye!"
      ]
    },
    {
      "speaker": "Alex",
      "cz": "Není zač! Přeji ti hezký den a ať dobře dorazíš!",
      "en": "You're welcome! Have a great day and safe travels!"
    }
  ]
}
