{"My level's too high to (Happy, happy, happy, happy)  bring me down": "Moje hladina je příliš vysoká na to, aby mě (Happy, happy, happy, happy) srazila dolů.", "(Because I'm happy)": "(Protože jsem šťastný)", "Clap along if you feel like a room without a roof": "Tleskejte, pokud se cítíte jako v místnosti bez střechy.", "Can't nothing (Happy, happy, happy, happy) bring me down": "Nic mě nemůže (Happy, happy, happy, happy) srazit na kolena.", "Can't nothing (Happy), bring me down": "Can't nothing (Happy), bring me down", "Well, give me all you got, don't hold it back (Yeah!)": "No, dej mi všechno, co máš, nezadržuj to (Jo!)", "Clap along if you feel like that's what you wanna do (Hey! Come on! Uh!)": "Tleskejte, pokud máte pocit, že to je to, co chcete dělat (Hej! No tak! Uh!)", "Sunshine, she's here, you can take a break": "Sluníčko, je tady, můžeš si odpočinout.", "Clap along if you feel like that's what you wanna do (Come on)": "Tleskejte, pokud máte pocit, že to chcete udělat (Come on)", "Can't nothing (Happy), bring me down, I said": "Nemůže nic (Happy), mě srazit na kolena, řekl jsem.", "Clap along if you know what happiness is to you": "Tleskejte, pokud víte, co je pro vás štěstí.", "I'm a hot air balloon that could go to space": "Jsem horkovzdušný balón, který může letět do vesmíru.", "Well, I should probably warn ya, I'll be just fine (Yeah!)": "No, asi bych vás měl varovat, že budu v pohodě (Jo!)", "(Happy) Bring me down": "(Happy) Přiveď mě dolů", "You know you can count on me like one, two, three, I'll be there": "Víš, že se mnou můžeš počítat jako s jednou, dvěma, třemi, budu tam.", "It was recorded in Larrabee… Read More [Intro]": "Bylo nahráno v Larrabee... Přečtěte si více [Intro]", "And I know when I need it": "A vím, kdy ji budu potřebovat", "I'll sail the world to find you": "Budu se plavit světem, abych tě našel.", "'Cause that's what friends are s'posed to do, oh, yeah": "Protože to je to, co přátelé dělají, oh, yeah", "If you ever find yourself stuck in the middle of the sea": "Pokud někdy uvíznete uprostřed moře.", "Just as long as you stand, stand by me": "Jen dokud stojíš, stůj při mně", "Woah, just stand now": "Woah, teď se postavte", "Oh, stand by me": "Oh, stůj při mně", "No, I won't shed a tear": "Ne, neproliju ani slzu.", "Darlin', darlin', stand by me": "Miláčku, miláčku, stůj při mně", "And the land is dark": "A země je temná", "Yo (Yeah), Pi'erre, you wanna come out here?": "Jo, Pi'erre, chceš jít ven?", "All these niggas (What? What?) always fold (What? What?)": "Všichni ti negři (Co? Co?) se vždycky složí (Co? Co?)", "(Yeah, yeah, yeah, yeah, yeah, yeah)": "(Jo, jo, jo, jo, jo, jo, jo)", "I'm in London (What?), Yung Carti global (What?)": "Jsem v Londýně (Cože?), Yung Carti global (Cože?)", "Damn, that look like Carti (Yeah-yeah)": "Sakra, to vypadá jako Carti (Yeah-yeah)", "When I drop, yeah (Drop, drop)": "When I drop, yeah (Drop, drop)", "Clap along if you feel like that's what you wanna do": "Tleskejte, pokud máte pocit, že to chcete udělat."}